Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: So step three, the three Na plusses, sodium ions-- are released outside.
ht: Se konsa étape twa, twa Na plusses, odyòm ions - sont te libere sou deyò.

source: Now once it's in this configuration, we have all these positive ions out here.
ht: Koulye a, yon fwa ke li se nan configuration sa a, nou genyen tout sa yo ions pozitif soti isit la.

source: These positive ions want to get really as far away from each other as possible.
ht: Ions pozitif sa yo vle pran vrèman te wete kò yo nan chak lòt ke nou kapab.

source: They'd actually probably be attracted to the cell itself because the cell is less positive on the inside.
ht: Yo aktyèlman pwobableman ta a pou sèlil tèt li paske sèlil a mwens pozitif vlope tripay la.

source: So these positive ions-- and in particular, the potassium-- can bond this side of the protein when it's in this-- I guess we could call it this activated configuration.
ht: Ions pozitif se konsa sa yo an e an patikilye, Potasyòm a - ka bond de protéines a bò sa a nan men ­ mwen panse nou te kapab rele sa configuration activé sa a.

source: So now, I guess we could call it step four.
ht: Men koulye a, mwen panse nou te kapab rele l' pa nan kat.

source: We have two sodium ions bond to-- I guess we could call it the activated pump-- or changed pump.
ht: Nou gen bon de Sodyòm ions garanti pou - m panse nou te kapab rele l ponp activé - ou chanje ponp.

source: Or maybe we could say it's in its open form.
ht: Ou gen dwa nou te kapab di se nan li louvri fòm.

source: So they come here and when they bond, it re-changes the shape of this protein back to this shape, back to that open shape.
ht: Se konsa yo vini isit la lè yo bond, li re-changes a fòm de protéines sa a pou sa a fòm, tounen, tounen pou ki louvri fòm.

source: Now when it goes back to the open shape, these guys aren't here anymore, but we have these two guys sitting here and in this shape right here, all of a sudden these divots-- maybe they're not divots.
ht: Koulye a, lè pou l' tounen pou fòm louvri a, mesye sa yo pa la ankò, men nou gen mesye de sa yo te chita isit la Et nan fòm sa a dwa isit la, tou sa de yon soudaine divots sa yo ki petèt ke yo pa divots.

source: They're actually things in this big cluster of protein.
ht: Yo pa gen aktyèlman bagay nan sa a gwo grap de protéines.

source: They're not as good at staying bonded or holding onto these sodiums so these sodiums get released into the cell.
ht: Ke yo pa bon nan yo rete (ou exploitation sou sa sodiums pou sodiums sa yo jwenn relache nan selil a.

source: So step five, the pump-- this changes shape of pump.
ht: Étape se konsa senk, ponp a - sa chanje fòm nan ponp.

source: So pump changes shape to original.
ht: Se konsa ponp chanje fòm pou orijinal.

source: And then once we're in the original, those two sodium ions released inside the cell.
ht: Et puis yon fwa nan orijinal la, odyòm de sa ions publié anndan sèlil a.

source: We're going to see in the next few videos why it's useful to have those sodium ions on the inside.
ht: Nou pwal wè kèk vidéos Poukisa itil pou nan sa kap vini an gen moun ions odyòm vlope tripay la.

source: You might say, well, why don't we just keep pumping things on the outside in order to have a potential difference?
ht: Nou pa ka di, men, poukisa pa nou sèlman kenbe estime bagay sou pou yo fè yon gwo diferans deyò?

source: But we'll see these sodium ions are actually also very useful.
ht: Men, n ap wè sa ions Sodyòm sont aktyèlman tou trè itil.

source: So what's the net effect that's going on?
ht: Se konsa sa ye rezo effet sa k ap pase

source: We end up with a lot more sodium ions on the outside and we end up with more potassium ions on the inside, but I told you that the inside is less positive than the outside.
ht: Nou fini ak anpil ions odyòm sou deyò Et nou fini ak plis ions Potasyòm vlope tripay la, men, mwen te di ou à la pozitif mwens pase deyò a.

source: But these are both positive.
ht: Men, se sa les pozitif.

source: I don't care if I have more potassium or sodium, but if you paid attention to the ratios I talked about, every time we use an ATP, we're pumping out three sodiums and we're only pumping in two potassiums, right?
ht: Mwen pa swen si mwen gen plis Potasyòm ou odyòm, men si ou peye atansyon pou pousantaj mwen te pale osijè de, tout Lè nou sèvi ak yon ATP, nou ap estime soti twa sodiums Et nou ap estime sèlman nan de potassiums, dwat?

source: We pumped out three sodiums and two potassiums.
ht: Nou pompe soti twa sodiums Et de potassiums.

source: Each of them have a plus-1 charge, but every time we do this, we're adding a net-1 charge to the outside, right?
ht: Chak yo gen yon chaj plis-1, men, chak fwa nou fè sa, nou ap pandan l ajoute yon pèlen-1 chaj pou deyò a, dwat?

source: 3 on the outside, 2 to the inside.
ht: 3 sou deyò, 2 dans la pou.

source: We have a net-1 charge-- we have a plus-1 to the outside.
ht: Nou gen yon pèlen-1 frais-nou gen yon plis 1 lan.

source: So we're making the outside more positive, especially relative to the inside.
ht: Se konsa nou fè plis pozitif deyò, sitou sa k relatif à la pou yo.

source: And this is what creates that potential difference.
ht: Et sa a se sa kreye gwo diferans sa.

source: If you actually took a voltmeter-- a voltmeter measures electrical potential difference-- and you took the voltage difference between that point and this point-- or more specifically, between this point and that point, if you were to subtract the voltage here from the voltage there, you will get -70 millivolts, which is generally considered the resting voltage difference, the potential difference across the membrane of a neuron when it's in its resting state.
ht: Si ou aktyèlman pran yon voltmètre - voltmètre yon mesures elèktrik diferans potansyèl - Et ou te fè a vòltaj diferans ant pwen sa yo ak pwen sa a - ou plis espesyalman, ant sa montre ak ki montre, si ou te gen pou retire vòltaj la isit la nan vòltaj la la a, n' a jwenn-70 millivolts, ki se jeneralman konsidere kòm au vòltaj diferans, de diferans Sur len de ewonn yon lè se nan li au eta.

source: So in this video, I kind of laid out the foundation of why and how a cell using ATP, using energy, is able to maintain a potential difference across its membrane where the outside is slightly more positive than the inside.
ht: Se konsa nan videyo sa a, mwen ti jan de mete deyò fondasyon de poutèt ak ki jan yon selil ki itilize ATP, w ap itilize fòs, ka kenbe potansyèl yon diferans Sur len li ki kote deyò yon ti jan plis pozitif pase à la.

source: So we actually have a negative potential difference if we're comparing the inside to the outside.
ht: Se konsa nou gen aktyèlman yon gwo diferans si nou comparaison à lan.

source: Positive charge would want to move in if they were allowed to, and negative charge would want to move out if it was allowed to.
ht: Frais pozitif ki ta vle pou yo avanse si yo te pèmèt yo Et negatif frais ta vle pou rale kò li si li te genyen yo te pèmèt pou yo.

source: Now there might be one last question.
ht: Koulye a pa te ka gen yon sèl dènye kesyon.

source: You might say, well, if we just kept adding charge out here, our voltage difference would get really negative.
ht: Nou pa ka di, men, si nou jis kenbe ajout frais deyò isit la, diferans vòltaj nou ta ka vrèman negatif.

source: This would be much more negative than the outside.
ht: Sa se ta bezwen mande negatif pase deyò a.

source: Why does it stabilize at -70?
ht: Poukisa ki fè li ekilibre nan-70?

source: To answer that question-- these are going to come into play in a lot more detail in future videos-- you also have channels, which are really protein structures that in their open position will allow sodium to go through them.
ht: Reponn kesyon sa - yo pwal antre nan jwe nan plis détail nan pwochen vidéos-w gen anpil chèn televizyon, ki vrèman protéines structures sa nan kan louvri yo pwal pèmèt odyòm pou pase nan mitan yo.

source: And there are also channels that are in their open position, would allow potassium to go through them.
ht: Et genyen tou chèn televizyon ki nan pòt louvri yo pozisyon, pwal pèmèt Potasyòm pou pase nan mitan yo.

source: I'm drawing it in their closed position.
ht: Mwen menm dessin li nan pozisyon fèmen pòt yo.

source: And we're going to talk in the next video about what happens when they open.
ht: E nou pral pale nan sa kap vini an vidéo de sa k rive koukouloukou Lè yo louvri.

source: But in their closed position, they're still a little bit leaky.
ht: Men, nan pozisyon fèmen pòt yo, y' ap toujou yon ti jan koule.

source: And if, say, the concentration of potassium becomes too high down here-- and too high meaning when they start to reach this threshold of -70 millivolts-- or even better, when the sodium gets too high out there, a few of them will start to leak down.
ht: Et si, di, konsantrasyon de Potasyòm devient twò gwo isit - e ki vle di pi wo ke lè yo kòmanse pou rantre sa a seuil de-70 millivolts - ou menm pi bon Lè odyòm a gen twò gwo la, de twa nan yo a kòmanse pou fuite desann.

source: When the concentration gets really high and this is really positive just because of the electrical potential, some of them will just be shoved through.
ht: Lè a konsantrasyon obtient vrèman haute Et sa se pozitif sèlman paske potentiel elektrik, kèk nan yo pral jis pou est à.

source: So it'll keep us right around -70 millivolts.
ht: Se konsa, li pwal kenbe nou dwe apepwè-70 millivolts.

source: And if we go below, maybe some of the potassium gets leaked through the other way.
ht: Et si n' ap pi ba pase, petèt kèk nan Potasyòm a obtient se nan lòt chemen.

source: So even though when these are shut-- if it becomes too ridiculous-- if it goes to -80 millivolts or -90 millivolts, all of a sudden, there'd be a huge incentive for some of this stuff to leak through their respective channels.
ht: Se konsa menm menm si lè sa yo fèmen ­ si l' vin tou ridicule ­ si l' ale pou-80 millivolts ou-90, millivolts, tout de yon soudaine, ta genyen yon gwo incentive pou kèk bagay sa a pou fuite à yo mennen y canaux.

source: So that's what allows us to stay at that stable voltage potential.
ht: Se poutèt sa, se sa ki pèmèt nou pou rete sou sa estab vòltaj potansyèl.

source: In the next video, we're going to see what happens to this voltage potential when the neuron is actually stimulated.
ht: Nan videyo kap vini an, nou pral wè sa k rive koukouloukou sa vòltaj potentiel lè ewonn a aktyèlman encouragé.

source: We're on problem 53.
ht: Nou sou pwoblem senkant twa.

source: It says Toni is solving this equation by completing the square. ax squared plus bx plus c is equal to 0, where a is greater than 0.
ht: Li di Toni ap rezoud ekwasyon sa a pa ranpli a kare. "ax" kare plis "bx" plis "c" se egal a "0", kote yon "a" pi gran pase "0."

source: So this is just a traditional quadratic right here.
ht: Sa se yon kwadratik tradisyonèl

source: And let's see what they did.
ht: Ann nou wè sa yo te fe la

source: First, he subtracted c from both sides and he got ax squared plus bx is equal to minus c.
ht: Premye, li soustrè "c" sou toude bò ak li resevwa "ax." kare plis "bx" ki egal a soustrè "c."

source: In this video we're going to talk about another way of visualizing data called the histogram, which is a very fancy word for a not so fancy thing.
ht: Nan videyo sa a nou pwal pale osijè de yon lòt wout de visualiser done te rele kimilatif a, ki se yon trè fantaisie lòd pou yo te yon bagay ki pa pour fantaisie.

source: I think it's probably fair to say that the histogram is the most used way of representing statistical data.
ht: Mwen panse li se kapab byen bèl pou di ke kimilatif a se la pi fò ki te itilize jan pou yo sèvi qui done Statistique.

source: Let me just show you how to figure out a histogram for some data, and I think you're going to get the point pretty easily.
ht: Kite m' jis montre ou kijan pou evalye yon kimilatif pou kèk done, e mwen panse nou pwal gen a pwen trè fasil.

source: So I have some data here and I want to represent it with a histogram.
ht: Se konsa mwen gen kèk done isit la, mwen vle pou yo repwezante li ak yon kimilatif.

source: What we're going to see is how frequent are each of these numbers.
ht: Kisa nou pral wè se sont ki konn chak nan anpil nan moun sa yo.

source: And in order to figure that out, let me just write the numbers down, let me just categorize them in their respective buckets.
ht: Pou ou kapab figure ki deyò, pou m' ekri jis la anpil moun atè, kite m. Se pou jis classer yo nan yo mwèl respectives.

source: So I have a 1 here.
ht: Se konsa, mwen gen yon 1 isit la. ...

source: I have a 4, so I want to leave space for the 2, the 3, and put a 4 there.
ht: Mwen gen yon 4 lan, se konsa mwen vle pou yo kite plas pou 2, 3 la, Et mete yon a 4.

source: I have a 2.
ht: M fè yon 2. / kè m boule m.

source: I have a 1.
ht: M fè yon 1. / kè m boule m.

source: Let me put that 1 on a stack right above that 1.
ht: Kite m' mete 1 sa sou yon pile droit anwo 1 sa.

source: I have a 0-- let me put the 0 to the left of the 1.
ht: Mwen gen yon 0-kite m' mete 0 a sou bò gòch de 1 an.

source: I want to put them in order.
ht: Mwen vle pou mete yo nan lòd.

source: I have a 2, another 2.
ht: Mwen gen yon 2, yon lòt 2.

source: Let me stack that above my first 2.
ht: Kite m. Se pou pile ki pi wo pase m' premye 2.

source: I have another 1.
ht: M fè yon lòt 1. / kè m boule m.

source: Let me stack that above my other two 1's.
ht: Kite m. Se pou pile ki pi wo pase m' lòt de 1.

source: I have another 0.
ht: M fè yon lòt 0. / kè m boule m.

source: Let me stack it there.
ht: Kite m. Se pou pile l' la.

source: Then I have another 2.
ht: Lè sa a, mwen gen yon lòt 2.

source: Another 1.
ht: Yon lòt 1.

source: I have two more 0's.
ht: M gen de plis 0 a.

source: I have two more 2's.
ht: M gen de plis 2 an. ...

source: I have a 3.
ht: M fè yon 3. / kè m boule m.

source: I have two more 1's.
ht: M gen de plis 1 an. ...

source: Another 3.
ht: Yon lòt 3.

source: And then I have a 6.
ht: E mwen gen yon 6.

source: So no 5's, and then I have a 6.
ht: Se konsa, li pa gen 5. Apre sa mwen gen yon 6.

source: And that space right there was unnecessary.
ht: Et la a plas sa li te genyen pa nesesè.

source: But right here I've listed-- I've just rewritten those numbers and I've essentially categorized them.
ht: Men dwat isit la mwen te mansyone - mwen te jis sous moun numéros Et mwen te gen esansyèlman par yo.

source: Now what I want to do is calculate how many of each of these numbers we have.
ht: Koulye a sa mwen vle fè se kalkile konbyen nan chak nan nimewo sa nou genyen.

source: So let me go down here.
ht: Se pou m' desann isit la.

source: So I want to look at the frequency of each of these numbers.
ht: Se konsa mwen vle gade a, fréquence de chak nan anpil nan moun sa yo. ...

source: So I have one, two, three, four 0's.
ht: Se konsa mwen gen yon sèl, de, twa, kat 0 a.

source: I have one, two, three, four, five, six, seven 1's.
ht: Mwen gen yon sèl, de, twa, kat, senk, sis, sèt 1 an.

source: I have one, two, three, four, five 2's.
ht: Mwen gen yon sèl, de, twa, kat, senk 2 an.

source: I have one, two 3's.
ht: Mwen gen yon sèl, de 3.

source: I have one 4, and one 6.
ht: Mwen gen yon sèl 4, ak yon sèl 6.

source: So we could write it this way.
ht: Se konsa nou te kapab ekri l' chemen sa a.

source: We could write the number, and then we can have the frequency.
ht: Nou te kapab ekri sa a anpil, lè sa a nou ka gen a, fréquence. ...

source: So I have the numbers 0, 1, 2, 3, 4-- we could even throw 5 in there, although 5 has a frequency of 0.
ht: Se konsa, mwen gen anpil moun, 0, 1, 2, 3, 4 - nou te kapab menm voye 5 nan la a, malgre 5 gen yon fréquence de 0.

source: And we have a 6.
ht: Apre sa, nou gen yon 6.

source: So the 0 showed up four times in this data set.
ht: Se konsa 0 l' a kat fwa nan ansanm nonm enfòmasyon sa a.

source: 1 showed up seven times in this data set.
ht: 1 a sèt fwa nan ansanm nonm enfòmasyon sa a.

source: 2 showed up five times, 3 showed up to two times, 4 showed up one time, 5 didn't show up, and 6 showed up one time.
ht: 2 a moute an senk fwa, 3 a jiska de fwa, 4 a leve yon sèl fwa, 5 pa montre ou leve, Et 6 a leve yon sèl fwa.

source: All I did is I counted this data set, and I did this first.
ht: Tou sa mwen te fè mwen fin konte enfòmasyon sa a, ansanm ak mwen t' ap fè sa premye.

source: But you could say how many times do I see a 0?
ht: Men, ou te kapab di konbyen fwa mwen wè yon 0?

source: I see it one, two, three, four times.
ht: Mwen wè li, de, twa, kat fwa.

source: How many times do I see a 1?
ht: Konben fwa mwen wè yon 1?

source: One, two, three, four, five, six, seven times.
ht: Yon sèl, de, twa, kat, senk, sis, sèt fwa.

source: That's what we mean by frequency.
ht: Sa se sa nou: pa fréquence.

source: Now a histogram is really just a plot, kind of a bar graph, plotting the frequency of each of these numbers.
ht: Koulye a, yon kimilatif se vwèman inikman yon konplo, jan de yon graf bar, traçage konbyen souvan yo fè chak nan anpil nan moun sa yo.

source: It's going to look a lot like this original thing that I drew.
ht: Li pwal sanble anpil orijinal sa a bagay sa a m' a.

source: So let me draw some axes here.
ht: Se pou m' fè kèk rach isit la.

source: So the different buckets here are the numbers.
ht: Se konsa yo diferan mwèl ici sont anpil moun la.

source: And that worked out because we're dealing with very clean integers that tend to repeat.
ht: Sa te travay paske gen pou nou ap wè ak anpil bale entiers sa gen tandans pou repete.

source: If you're dealing with things that the exact number doesn't repeat, oftentimes people will put the numbers into buckets or ranges.
ht: Si w ap gen pou wè ak bagay ke nonb ekzat la pa répéter, souvent moun ap fè anpil moun la nan mwèl ou plages.

source: But here they fit into nice little buckets.
ht: Men, isit la yo anfòm nan bèl ti mwèl.

source: You have the numbers 0, 1, 2, 3, 4, 5, and 6.
ht: Ou gen anpil 0, 1, 2, 3, 4, 5 ak 6.

source: This is the actual numbers.
ht: Sa se les numéros réelle.

source: And then on the vertical axis we're going to plot the frequency.
ht: Et puis sou aks vètikal a nou ap pwal pou tracé a, fréquence.

source: So one, two, three, four, five, six, seven.
ht: Se konsa yon sèl, de, twa, kat, senk, sis, sèt.

source: So that's 7, 6, 5, 4, 3, 2, 1.
ht: Se konsa, sa se 7, 6, 5, 4, 3, 2, 1.

source: So 0 shows up four times.
ht: Se konsa, 0 montre moute kat fwa.

source: So we'll draw a little bar graph here.
ht: Se poutèt sa, nou ap trase yon ti kafe graf isit la.

source: 0 shows up four times.
ht: 0 montre moute kat fwa.

source: Draw it just like that.
ht: Trase li jis kon sa.

source: That is that information right there.
ht: Sa se isit-la-enfòmasyon sa.

source: 1 shows up seven times.
ht: 1 montre moute sèt fwa.

source: So I'll do a little bar graph.
ht: Se konsa, m a fè yon ti kafe graf.

source: 1 shows up seven times. Just like that.
ht: 1 montre moute sèt fwa. annik konsa.

source: I want to make it a little bit straighter than that-- 1 shows up seven times.
ht: Mwen vle fè l' yon ti jan straighter pase sa - 1 montre

source: 2-- I'll do it in a different color-- 2 shows up five times.
ht: leve kanpe sèt fwa. ... 2 - M ap fè l nan yon lòt koulè - 2 ki montre ke moute an senk fwa. ...

source: Do a bar graph, go all the way up to five.
ht: Èske yon graf bar, ale jouk yo rive bay senk.

source: 2 shows up five times.
ht: 2 montre moute an senk fwa.

source: 3 shows up two times.
ht: 3 montre moute de fwa. ...

source: We have one 3, two 3's.
ht: Nou gen yon sèl 3, de 3.

source: 4 shows up one time here. 5 doesn't show up at all.
ht: 4 montre leve yon sèl moman isit la. ... 5 pa montre nan peyi sa.

source: So it doesn't even get any height there.
ht: Se konsa, li pa menm gen yon wotè.

source: And then finally, 6 shows up one time.
ht: Et puis finalman, 6 montre leve yon sèl fwa.

source: So I'll do 6 showing up one time.
ht: Se konsa m a fe pa 6 ki montre leve yon sèl fwa.

source: What I just plotted here, this is a histogram.
ht: Kisa mwen sèlman tracées isit la, sa se yon kimilatif.

source: This right here is a histogram.
ht: Isit-menm se yon kimilatif.

source: Very fancy word, but I think you will agree it's a fairly simple idea.
ht: Trè fantaisie pawòl, men, mwen kwè nou pwal dakò se yon assez senp idée.

source: Figure out the frequency of each of these numbers and then plot the frequency of each of these numbers and you get yourself a histogram.
ht: Evalye konbyen souvan yo fè chak nan anpil nan moun sa yo, lè sa a traçage konbyen souvan yo fè chak nan anpil nan moun sa yo ak ou jwenn tèt ou yon kimilatif. ...

source: That's it!
ht: Men nou la an 2013 nou tout depann de teknologi pou nou kommunike, pou nou ranmase e pa gen youn nan nou ki konnen kijan yo li ou ekri kode! premye programm mwen ekri se te poum poze kestion tankou "kisa ki koule ou pi renmen?" ou bien" ki laj ou?" mwen ekri on programm pou'm te ka jwe ti-ta-to. premie bagay mwen te apprann se te kijan pou mwen fe on rondelle vet andan on karre rouj parett nan ekran an. ou jis vle esaye on bagay, esaye transfere on bagay ki sot nan tete ou a komputer a ou tablete la. se on ... se on experyans tout limit nan system se jis ke pa gen ase moun ki antrene et ki gen kompetans sa yo jodia programeur demin yo se asistan nan future nou ou konnen, ou pral sanble ke ou genyen pouvwa majik kompare ak lot moun bon jan kodeu se gwo moun yo ye jodia se tou code.org ninpot moun ka apprann.

source: Welcome to the presentation on BASlC ADDlTION.
ht: Bienvenue pwezantasyon sou ADISYON BASE.

source: I know what you're thinking:
ht: Mwen konnen kisa w panse:

source: "Sal, addition doesn't seem so basic to me."
ht: "Sal, adisyon pa sanble afin de baz pou m."

source: Well, I apologize.
ht: Men, mwen regrete.

source: I hope I --
ht: Mwen espere ke m-

source: Hopefully, by the end of this presentation, or in a couple of weeks, it will seem basic.
ht: Que, nan fen pwezantasyon sa a, ou nan anviron de semèn, sa w'a fè yo wè de baz.

source: So lets get started with,
ht: Pour vous obtenez te kòmanse avèk,

source: I guess we could say, some problems.
ht: Mwen panse nou te kapab di, kèk pwoblèm.

source: Well, let's say I start with an old classic.
ht: Byen, non, ann di mwen kòmanse avèk yon vye klasik.

source: And I think you already know how to do this.
ht: E mwen panse nou deja konnen kijan pou fè sa.

source: But, I'll kind of show you a way of doing this, in case you don't have this memorized, or you haven't already mastered this.
ht: Men m ap ti jan montre ou yon fason ki ap fè sa, nan ka, ou pa gen men bien, ou, ou pa deja image sa a.

source: You say, well, if I have one (Let's call that an avocado.)
ht: Nou di: Men, si mwen gen yonn (An n rele sa yon pye zaboka.)

source: If I have 1 avocado, and then you were to give me another avocado, how many avocados do I now have?
ht: Si mwen gen pye zaboka 1, e apre sa ou te ban m' yon lòt pye zaboka Depi konben avocats mwen kounye a gen?

source: Well, let's see.
ht: Byen, non, ann gade.

source: I have 1 ... 2 avocados.
ht: Mwen gen 1... 2 avocats.

source: So 1 + 1 is equal to 2.
ht: Pour 1 + 1 egal a 2.

source: Now, I know what you are thinking:
ht: Koulye a, mwen konnen sa ou panse:

source: "That was too easy."
ht: "Sa te twò fasil."

source: So, let me give you something a little bit more difficult.
ht: Se konsa, pou m' ba ou yon bagay yon ti jan pi difisil.

source: I like the avocados.
ht: Mwen renmen les avocats.

source: I might stick with that theme.
ht: Mwen te ka kanmenm tèm sa.

source: What is 3 + 4?
ht: Nan ki sa wap 3 + 4

source: This is, I think, a more difficult problem.
ht: Men, mwen panse ke, yon pwoblèm ki pi difisil.

source: Well, let's stick with the avocados.
ht: Byen, an n kanmenm les avocats.
